{
  "a posteriori": "relating to or denoting reasoning or knowledge which proceeds from observations or experiences to the deduction of probable causes.",
  "a priori": "relating to or denoting reasoning or knowledge which proceeds from theoretical deduction rather than from observation or experience.",
  "abduction": "also known as abductive reasoning or inference to the best explanation, is a form of logical inference that starts with an observation and seeks the most likely explanation for that observation.",
  "abstract objects": "every entity is either concrete or abstract; abstract entities that exist independently of human perception or spatiotemporal location. They are non-physical, non-mental, and not bound by time. Examples include numbers, sets, propositions, and fictional characters.",
  "ad hoc": "means \"for this\" or \"for this purpose\". For the specific purpose, case, or situation at hand and for no other.",
  "analytic proposition": "true or not true solely by virtue of their meaning where the predicate is already contained within the subject.",
  "analytic-synthetic distinction": "a philosophical concept that differentiates between two types of truths: analytic and synthetic",
  "anarcho-syndicalism": "control production, you conrol money, then you control society; political philosophy and anarchist school of thought that views revolutionary industrial unionism or syndicalism as a method for workers in capitalist society to gain control of an economy and thus control influence in broader society",
  "anecdotal": "You used a personal experience or an isolated example instead of a sound argument or compelling evidence.",
  "antirealism": "the truth of a statement rests on its demonstrability through internal logic mechanisms, such as the context principle or intuitionistic logic, in direct opposition to the realist notion that the truth of a statement rests on its correspondence to an external, independent reality.",
  "axiom": "A self-evident or universally recognized truth; a maxim.; An established rule, principle, or law.",
  "black-or-white fallacy": "You presented two alternative states as the only possibilities, when in fact more possibilities exist.",
  "brute contingency": "a brute contingent fact is a fact that is true but could have been false, and has no explanation for why it's true.",
  "burden of proof": "You said that the burden of proof lies not with the person making the claim, but with someone else to disprove.",
  "cartesian certainty": "refers to the idea of achieving a foundational level of knowledge that is indubitable and beyond any reasonable doubt.",
  "cartesianism": "species of rationalism, because Cartesians hold that knowledge—indeed, certain knowledge—can be derived through reason from innate ideas.",
  "Causal Determinism": "historical determinism; the idea that every event is necessitated by antecedent events and conditions together with the laws of nature",
  "cause": "The producer of an effect, result, or consequence.",
  "code": "A system of signals used to represent letters or numbers in transmitting messages.",
  "coherence theory of epistemic justification": "According to the coherence theory of justification, also known as coherentism, a belief or set of beliefs is justified, or justifiably held, just in case the belief coheres with a set of beliefs, the set forms a coherent system, or some variation on these themes.",
  "coherence theory of truth": "A coherence theory of truth states that the truth of any (true) proposition consists in its coherence with some specified set of propositions.",
  "coherintist": "the coherence theory of truth; and the coherence theory of justification.",
  "compatibilist": "determinism is compatible with free will",
  "composition/division fallacy": "You assumed that one part of something has to be applied to all or other parts of it; or that the whole must apply to its parts.",
  "concequentialist": "normative properties depend only on consequences",
  "constructivism": "individuals or learners do not acquire knowledge and understanding by passively perceiving it within a direct process of knowledge transmission, rather they construct new understandings and knowledge through experience and social discourse, integrating new information with what they already know",
  "contingency": "An event that may occur but that is not likely or intended; a possibility",
  "contradiction": "a proposition, statement, or phrase that asserts or implies both the truth and falsity of something",
  "deductive": "deriving conclusions by reasoning",
  "define": "To state the precise meaning of ",
  "deism": "god created universe and set it up, but does not intervene",
  "diachrony": "as in historical linguistics, considers the development and evolution of a language through history.",
  "dualism": "separation of mind/matter; mind/body can function separately",
  "entity": "every entity falls into either abstract or concrete",
  "epistemology": "nature of knowing",
  "epistemology vs ontology": "e: ways we know things, o: the way things are",
  "eternal": "without beginning or end ",
  "ethics": "moral philosophy; is a branch of philosophy that \"involves systematizing, defending, and recommending concepts of right and wrong behavior",
  "etymology": "Study of the history of linguistic forms, that is the history of how words are written and pronounced, and how their spelling and pronunciation changed",
  "euthyphro dilemma": "asks whether a thing is good because God says it is good, or does God say it’s good because it is good",
  "evidentialism": "justified to believe if and only if you have evidence that supports your belief",
  "explain": "make (an idea, situation, or problem) clear to someone by describing it in more detail or revealing relevant facts or ideas.",
  "explanation": "explaining: to make known",
  "explication": "The act of unfolding or opening; explaining",
  "fact": "what the world is made of? Knowledge or information based on real occurrences.",
  "fallabalism": "knowledge does not require certainty",
  "fallacy fallacy": "You presumed that because a claim has been poorly argued, or a fallacy has been made, that the claim itself must be wrong.",
  "fatalism": "The doctrine that all events are predetermined by fate and are therefore unalterable.",
  "fundamental": "of or relating to the foundation or base",
  "genetic fallacy": "You judged something as either good or bad on the basis of where it comes from, or from whom it came.",
  "gettier cases": "examples that knowledge is not justified true belief; shows scenario where individual is right about proposition but process by which they are right didn't guarantee they had knowledge",
  "gnosis": "Intuitive apprehension of spiritual truths, an esoteric form of knowledge sought by the Gnostics.",
  "god of spinoza": "created everything, hit start, and doesn't interrupt; points at creator / god distinction; biological father vs father",
  "heterodox": "Not in agreement with accepted beliefs, especially in church doctrine or dogma.",
  "heuristic": "Of or relating to a usually speculative formulation serving as a guide in the investigation or solution of a problem.",
  "hypothesis": "tentative explanation of observations",
  "igtheism": "ignosticism; The philosophical position that beliefs regarding the existence or non-existence of God (capitalized) all assume too much, especially because there is not just one universal definition of the word \"God\" or because the concept of \"God\" is both unfalsifiable and unverifiable; also called \"theological noncognitivism\".",
  "incompatibilist": "determinism is incompatible with free will",
  "indeterminism": "unpredictability; some events (human actions / decisions) have no cause",
  "induction": "base on observation",
  "inductive logic": "a logic of evidential support",
  "inductive": "of, relating to, or employing mathematical or logical induction",
  "inference": "The act or process of deriving logical conclusions from premises known or assumed to be true.",
  "justification": "justify: to prove or show to be just, right, or reasonable",
  "Laplaces Demon": "Causal Determinism by Pierre-Simon Laplace; free will is an illusion because of causal determinism; According to determinism, if someone (the demon) knows the precise location and momentum of every atom in the universe, their past and future values for any given time are entailed; they can be calculated from the laws of classical mechanics.",
  "libertarian free will": "ability to have done otherwise",
  "loaded question": "You asked a question that had a presumption built into it so that it couldn't be answered without appearing guilty.",
  "nature": "the material world and its phenomena",
  "neoplatonism": "platonism + aristotelianism + oriental mysticism ",
  "nominalism": "abstract concepts, general terms, or universals have no independent existence but exist only as names",
  "nothing": "No thing; not anything. No part; no portion. One of no consequence, significance, or interest.",
  "observant": "Having or showing keen perceptiveness; perceptive.",
  "omnipresent": "Present everywhere simultaneously",
  "omniscient": "Having total knowledge; knowing everything.",
  "ontological argument": "An ontological argument is a philosophical argument, made from an ontological basis, that is advanced in support of the existence of God. Such arguments tend to refer to the state of being or existing.",
  "ontology": "The branch of metaphysics that deals with the nature of being.",
  "orthopraxy": "study of religion; correct conduct both ethical and liturgical",
  "ought": "used to indicate duty or correctness, typically when criticizing someone's actions.; used to indicate something that is probable.",
  "panentheism": "all things are contained within god",
  "pantheism": "worship all gods; see god(s) in all things",
  "paraconsistent": "Tolerant towards inconsistencies.",
  "pascals wager": "It posits that humans bet with their lives that God either exists or does not.",
  "philo": "denoting a liking for a specified thing.",
  "philosophy": "\"philo\" and \"sophia\"; is the study of fundamental questions about existence, knowledge, values, reason, mind, and language.",
  "platonsim": "abstract objects exist",
  "possible": "Capable of happening, existing, or being true without contradicting proven facts, laws, or circumstances.",
  "post hoc ergo propter hoc": "after this, therefore because of this: because an event occurred first, it must have caused this later event - used to describe a fallacious argument",
  "post hoc": "relating to or being the fallacy of arguing from temporal sequence to a causal relation",
  "postdiction": "An assertion or deduction about something in the past; the act of making such an assertion or deduction.",
  "pragmatist": "a person who takes a practical approach to problems and is concerned primarily with the success or failure of his or her actions",
  "predicting": "to declare or indicate in advance",
  "Problem of Induction": "a philosophical issue that questions the validity of inferring general conclusions from specific observations. Essentially, it asks how we can justify assuming that future events will resemble the past ones, especially when our knowledge is based on limited past experiences.",
  "problem of underdetermination": "evidence available to us at a given time may be insufficient to determine what beliefs we should hold in response to it. Underdetermination says that all evidence necessarily underdetermines any scientific theory.",
  "proposition": "is either true or false; a claim that is either true/false; can never be both; (ie. law of non-contradiction); can never be in the middle (ie. law of excluded-middle)",
  "propter hoc": "means \"because of this\"; It is often used in the context of the logical fallacy \"post hoc ergo propter hoc,\" which translates to \"after this, therefore because of this\". This fallacy incorrectly assumes that because one event follows another, the first event caused the second",
  "PSR (principle sufficient reasoning)": "everything must have a reason, cause, or ground.",
  "ravens paradox": "question of what constitutes evidence for a statement. shows contradiction between inductive logic and intuition. Observing objects that are neither black nor ravens may formally increase the likelihood that all ravens are black even though, intuitively, these observations are unrelated.",
  "reason": "a statement offered in explanation or justification",
  "reflexive": "directed or turned back on itself",
  "sophia": "wisdom",
  "sophistry": "Plausible but fallacious argumentation.",
  "strawman": "You misrepresented someone's argument to make it easier to attack.",
  "structuralism": "a general theory of culture and methodology that implies that elements of human culture must be understood by way of their relationship to a broader system",
  "syllogism": "A form of deductive reasoning consisting of a major premise, a minor premise, and a conclusion; for example, All humans are mortal, the major premise, I am a human, the minor premise, therefore, I am mortal, the conclusion.",
  "synchrony": "A synchronic approach considers a language at a moment in time without taking its history into account. aims at describing a language at a specific point of time",
  "synthetic proposition": "truth, if any, derives from how their meaning relates to the world",
  "teleological argument": "argument for the existence of God or, more generally, that complex functionality in the natural world, which looks designed, is evidence of an intelligent creator.",
  "teleology": "The philosophical interpretation of natural phenomena as exhibiting purpose or design",
  "term (algebra)": "(ie. variable part and number part): 2a, 4b 5g 2x^2, etc.. coefficient (ie number part) variable part() a b g x^2) then ",
  "theory": "make falsifiable predictions; explain laws",
  "types of logic": "Aristotelian; Classical; Propositional; First-Order; Extended logics (extends classical): metaphysics, ethics, epistemology",
  "ubiquitous": "Being or seeming to be everywhere at the same time; omnipresent.",
  "ultimate": "last in series/process/progression (syn: last); eventual; fundamental; elemental;",
  "underdetermination": "the idea that the evidence available to support a scientific theory is often insufficient to uniquely determine that theory as the correct one,",
  "universalism": "christians who believe all people will be eventually saved",
  "universals": "Including, relating to, or affecting all members of the class or group",
  "virtue": "Moral excellence and righteousness; goodness; An example or kind of moral excellence.",
  "zionism": "nationalist movement that espouses the establishment of, and support for, a homeland for the Jewish people centered in the area roughly corresponding to the Land of Israel, the region of Palestine, Canaan, or the Holy Land, on the basis of a long Jewish connection and attachment to that land.",
  "zoroastrianism": "oldest religion, it is Iranian, has dualistic cosmology of good and evil, monotheistic ontology, prophet: Zoroaster"
}
