{
  "4 dimentional lorentzien manifold": "A four-dimensional Lorentzian manifold is a smooth, four-dimensional space (a manifold) where the metric (which defines distances and angles) is Lorentzian, meaning it has a signature of (3,1) or (1,3). This means it has three spatial dimensions and one time dimension, and the metric allows for both timelike, spacelike, and null vectors. It's a fundamental concept in general relativity, where spacetime is modeled as a Lorentzian manifold.",
  "astrophysics": "application of physics to the study of celestial bodies",
  "ATP synthase": "is a protein that catalyzes the formation of the energy storage molecule adenosine triphosphate (ATP) using adenosine diphosphate (ADP) and inorganic phosphate (Pi). It is classified under ligases as it changes ADP by the formation of P-O bond (phosphodiester bond).",
  "ATP": "adenosine triphosphate; type of molecular machine; an organic compound and hydrotrope that provides energy to drive many processes in living cells, such as muscle contraction, nerve impulse propagation, condensate dissolution, and chemical synthesis",
  "Bayes theorem": "In probability theory and statistics, Bayes' theorem, named after Thomas Bayes, describes the probability of an event, based on prior knowledge of conditions that might be related to the event",
  "bayesian": "A statistical method that updates the probability of a hypothesis as more evidence becomes available.",
  "cosmology": "study of the origin and development of the universe",
  "dark matter": "a hypothetical substance that makes up about 85% of the matter in the universe, but it doesn't interact with light or other electromagnetic radiation, making it invisible and undetectable by conventional means.",
  "dependent variable": "experimental result",
  "entropy": "a scientific concept as well as a measurable physical property that is most commonly associated with a state of disorder, randomness, or uncertainty.",
  "independent variable": "parameter being altered",
  "law": "summary of observations",
  "molecular machine": "is a molecular component that produces quasi-mechanical movements (output) in response to specific stimuli (input).[2][3] In cellular biology, macromolecular machines frequently perform tasks essential for life, such as DNA replication and ATP synthesis.",
  "n dimensional riemannian manifolds": "A space that locally resembles n-dimensional Euclidean space, equipped with a Riemannian metric, which allows for the measurement of lengths and angles.",
  "observation": "The act of observing.",
  "observing": "Giving particular attention; habitually attentive to what passes; observant{1}",
  "pauli exclusion principle": "quantum mechanical principle which states that two or more identical fermions cannot occupy the same quantum state within a quantum system simultaneously",
  "scientism": "The collection of attitudes and practices considered typical of scientists",
  "tertiary structure": "the three-dimensional structure of a protein—is the next level of complexity in protein folding. Whereas individual amino acids in the primary sequence can interact with one another to form secondary structures such as helices and sheets, and individual amino acids from distant parts of the primary sequence can intermingle via charge-charge, hydrophobic, disulfide, or other interactions, the formation of these bonds and interactions serve to change the shape of the overall protein. The folding that we end up with for a given polypeptide is the tertiary structure."
}
